Tekla.Structures.Filtering.NumericFilterExpression
The NumericFilterExpression class represents a numeric filter expression.

Tekla.Structures.Filtering.NumericFilterExpression.#ctor(System.String)
Initializes a new instance of the NumericFilterExpression class.
Value: The value to represent.

Tekla.Structures.Filtering.NumericFilterExpression.#ctor(System.String,System.String,System.String,System.String)
Initializes a new instance of the NumericFilterExpression class.
Name: The name of the expression.
Category: The category of the expression.
Property: The property of the expression.
LocalizationKey: The localization key of the expression.